# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [2]:
# Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston 

Hint: join the employees and offices tables.

In [4]:
# Your code here
# cur.execute('''SELECT (e.firstName + e.lastName) as name
#             FROM employees e
#             JOIN offices o
#             USING(officecode)
#             WHERE o.city IS 'Boston';''')
cur.execute('''SELECT officeCode, city
            FROM offices o
            JOIN employees e
            USING(officecode)
            WHERE o.city IS 'Boston';''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

   officeCode    city
0           2  Boston
1           2  Boston

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [5]:
# Your code here
cur.execute('''SELECT o.officeCode, o.city, COUNT(employeeNumber) as n_employees
            FROM offices o
            LEFT JOIN employees e
            USING(officeCode)
            GROUP BY officeCode
            HAVING n_employees IS 0;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

   officeCode    city  n_employees
0          27  Boston            0

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of every individual product that each employee has sold

In [6]:
def make_df(data):
    df = pd.DataFrame(data.fetchall())
    df.columns = [x[0] for x in data.description]
    return df

In [29]:
df = make_df(cur.execute('''SELECT (firstName || ' ' || lastName) as e_name, c.customerName, p.productName
                        FROM employees e
                        LEFT JOIN customers c 
                        ON e.employeeNumber = c.salesRepEmployeeNumber
                        LEFT JOIN orders o
                        USING(customerNumber)
                        LEFT JOIN orderdetails od
                        USING(orderNumber)
                        LEFT JOIN products p
                        USING(productCode)
                        WHERE c.customerName IS NOT NULL;'''))
df

                e_name       customerName                          productName
0     Gerard Hernandez  Atelier graphique                1965 Aston Martin DB5
1     Gerard Hernandez  Atelier graphique         1999 Indy 500 Monte Carlo SS
2     Gerard Hernandez  Atelier graphique       1948 Porsche Type 356 Roadster
3     Gerard Hernandez  Atelier graphique            1966 Shelby Cobra 427 S/C
4     Gerard Hernandez  Atelier graphique                1996 Moto Guzzi 1100i
...                ...                ...                                  ...
2993       Peter Marsh  Kelly's Gift Shop                     2002 Suzuki XREO
2994       Peter Marsh  Kelly's Gift Shop  1936 Harley Davidson El Knucklehead
2995       Peter Marsh  Kelly's Gift Shop                    1997 BMW R 1100 S
2996       Peter Marsh  Kelly's Gift Shop             1960 BSA Gold Star DBD34
2997       Peter Marsh  Kelly's Gift Shop                     1997 BMW F650 ST

[2998 rows x 3 columns]

In [49]:
df = make_df(cur.execute('''SELECT * FROM employees;'''))
df

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056,Sale Manager (EMEA)
5,1143,Bow,Anthony,x5428,abow@classicmodelcars.com,1,1056,Sales Manager (NA)
6,1165,Jennings,Leslie,x3291,ljennings@classicmodelcars.com,1,1143,Sales Rep
7,1166,Thompson,Leslie,x4065,lthompson@classicmodelcars.com,1,1143,Sales Rep
8,1188,Firrelli,Julie,x2173,jfirrelli@classicmodelcars.com,2,1143,Sales Rep
9,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143,Sales Rep
10,1286,Tseng,Foon Yue,x2248,ftseng@classicmodelcars.com,3,1143,Sales Rep
11,1323,Vanauf,George,x4102,gvanauf@classicmodelcars.com,3,1143,Sales Rep
12,1337,Bondur,Loui,x6493,lbondur@classicmodelcars.com,4,1102,Sales Rep
13,1370,Hernandez,Gerard,x2028,ghernande@classicmodelcars.com,4,1102,Sales Rep
14,1401,Castillo,Pamela,x2759,pcastillo@classicmodelcars.com,4,1102,Sales Rep
15,1501,Bott,Larry,x2311,lbott@classicmodelcars.com,7,1102,Sales Rep
16,1504,Jones,Barry,x102,bjones@classicmodelcars.com,7,1102,Sales Rep
17,1611,Fixter,Andy,x101,afixter@classicmodelcars.com,6,1088,Sales Rep
18,1612,Marsh,Peter,x102,pmarsh@classicmodelcars.com,6,1088,Sales Rep
19,1619,King,Tom,x103,tking@classicmodelcars.com,6,1088,Sales Rep
20,1621,Nishi,Mami,x101,mnishi@classicmodelcars.com,5,1056,Sales Rep
21,1625,Kato,Yoshimi,x102,ykato@classicmodelcars.com,5,1621,Sales Rep
22,1702,Gerard,Martin,x2312,mgerard@classicmodelcars.com,4,1102,Sales Rep

In [ ]:
# Your code here
cur.execute('''SELECT (firstName || ' ' || lastName) as name, 

            FROM office o
            JOIN employees e
            USING(officecode)
            WHERE o.city IS 'Boston';''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

## Level Up: Display the Number of Products each employee has sold

In [31]:
# Your code here
df = make_df(cur.execute('''SELECT (firstName || ' ' || lastName) as e_name, count(*) as number_of_products_sold
                        FROM employees e
                        LEFT JOIN customers c 
                        ON e.employeeNumber = c.salesRepEmployeeNumber
                        LEFT JOIN orders o
                        USING(customerNumber)
                        LEFT JOIN orderdetails od
                        USING(orderNumber)
                        LEFT JOIN products p
                        USING(productCode)
                        GROUP BY e_name
                        HAVING c.customerName IS NOT NULL;'''))
df

              e_name  number_of_products_sold
0        Andy Fixter                      185
1        Barry Jones                      220
2     Foon Yue Tseng                      143
3      George Vanauf                      211
4   Gerard Hernandez                      396
5     Julie Firrelli                      124
6         Larry Bott                      236
7    Leslie Jennings                      331
8    Leslie Thompson                      114
9        Loui Bondur                      177
10        Mami Nishi                      137
11     Martin Gerard                      115
12   Pamela Castillo                      272
13       Peter Marsh                      185
14   Steve Patterson                      152

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!